Revit 2027 API
BasePoint.GetProjectBasePoint Method
 Gets the project base point for the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static BasePoint GetProjectBasePoint(
	Document cda
)
Public Shared Function GetProjectBasePoint (
	cda As Document
) As BasePoint
public:
static BasePoint^ GetProjectBasePoint(
	Document^ cda
)
static member GetProjectBasePoint :
        cda : Document -> BasePoint
Parameters
cda Document
 The document from which to get the project base point.
Return Value
BasePoint
 The project base point of the document.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
BasePoint Class
Autodesk.Revit.DB Namespace